import { ChatLogInfo } from "@/type/chatLogInfo";

export const answerData: ChatLogInfo[] = [
  {
    position: "left",
    img: "会社.png",
    msg: "◆１.これまでご経験されている会社の入社理由・転職理由（今回含）を差し支えのない範囲で出来る限り詳しく教えてください。 ",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "一社目は「三浦工業株式会社」に入社しました。",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "入社理由としましては、「会社の安定性や福利厚生の面で優れていた」ためです。その企業が安定しているか、福利厚生は充実しているかというライフワークバランスを重視した観点で選びました。",
  },
  {
    position: "left",
    img: "会社.png",
    msg: "やりたいこと等はなかったのでしょうか？",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "そうですね、正直、学生時代は自分のやりたいことがなかなかみつけられず悩んでいました。当時、情報系の学科に所属していたため、どこの会社に入ろうが行う業務としては一緒だろうという考えで、、、それなら福利厚生の面で選んだ方がお得なのでは？という考えで選んでしまいました。",
  },
  {
    position: "left",
    img: "会社.png",
    msg: "ありがとうございます。２社目のエボルテック株式会社はどういった転職理由だったのでしょうか？",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "まず、転職時にはライフワークを重視した考え方ではなく、実力主義な職種という観点で企業選びを行いました。",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "数ある職種の中でIT企業を選んだ理由としましては、「学習の行いやすさ」、「パソコン一台で、自宅や会社という狭い空間からインターネットを通じて日本、世界中にサービスを届けられるという規模の大きさに魅了を感じた」という2つの理由からです。",
  },
  {
    position: "left",
    img: "会社.png",
    msg: "なるほどです。ちなみに前職では実力主義ではなかったのでしょうか？",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "サービスエンジニアという形で一部営業も行っておりましたので、まったく実力主義ではないかと言われるとそうではないのですが、職種上、どうしてもルーティーンワークが全体の8割を占めるという感じでした。",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "そのため、転職時には常に自分の実力で評価される環境に行ってみたいという思いがありました。",
  },
  {
    position: "left",
    img: "会社.png",
    msg: "ありがとうございます。ちなみにIT企業を選んだ理由の1つめに「学習のしやすさ」を挙げられておりましたが、これはどういうことでしょうか？",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "これは学習を行う環境を準備する手軽さのことを意味しています。例えば、他の技術職、、、車の整備士で考えると、技術力を上げるためには、実際に車や部品といったものを準備する必要があります。また、それらを用意するためには資金だったり専用の場所も必要になります。その点、ITではパソコン一台あれば、学習を行うことができ、場所にも縛られることはありません。",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "業務時間外や、土日、ちょっとした空いた時間にもしっかり自己研鑽に励むことができるのもITの魅力だと思います。",
  },
  {
    position: "left",
    img: "会社.png",
    msg: "ありがとうございます。最後に今回の転職理由を教えてください。",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "はい、これまで、受託開発の企業でシステム開発に携わって参りました。そこでは、様々な案件に携わり、幅広く技術を経験させていただきましたが、私自身、ただ開発だけを行う仕事だけでなく、自分が携わったサービスに深く関わり、顧客が求める機能やいただいたフィードバックを元に改善を行い、サービスを育てていくような体験をしたいという思いがあります。",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "こうした思いを叶えるために、自社製品を扱う企業に勤めさせていただきたいと思い、この度、転職を決意しました。",
  },
  {
    position: "left",
    img: "会社.png",
    msg: "◆２．次の会社での必要最低条件を教えてください。それは業種・職種・給与という観点もあると思いますし、それ以上に大切にしたいご自身の価値観という部分も入ってくるかと思われます。出来る限りその背景も含めて教えていただけますでしょうか。",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "「職場の雰囲気」という点を大事にしております。給与や福利厚生の面も大事だとは思いますが、それ以上に、一緒に仕事をしていくメンバーの雰囲気を重要視しております。具体的には、「助け合いの文化」だったり、「気軽に相談し合える」という雰囲気は魅力的に感じます。また、業務以外の面でも、技術力向上のために切磋琢磨し合える仲間がいるという点も大事にしております。",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "現職ですと、案件が違うメンバーとコミュニケーションを取る機会が少ないことや、扱う技術が違うことから、一緒に学習するメンバーがなかなか見つからず、いつも1人で学習を進めておりました。学習を進めていく上でぶつかる壁に一緒に乗り越えていけるような仲間が欲しいとは常に感じておりましたので、この転職の機会に同じ志をもった仲間と出会えればと考えています。",
  },
  {
    position: "left",
    img: "会社.png",
    msg: "◆３．当社へご興味を持っていただいている点をどういう視点でも結構ですので、教えてください。",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "2点ありまして、1点目が「人柄の良さ、職場の雰囲気」です。以前にカジュアル面談させていただいた際に、職場の雰囲気について聞けたこと、また担当してくださった田中様の人柄の良さに惹かれ、ぜひ一緒に仕事をしていきたいと感じました。",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "2点目は「お客様の生の声が聞けること」です。実際にサービスを使ったお客様の反応が分かり、要望の実現や機能改善を行うことで、お客様の満足する声が聞けたり、そうした積み重ねでサービスを成長させていくことに魅力を感じております。",
  },
  {
    position: "left",
    img: "会社.png",
    msg: "◆４．現年収と希望年収について教えてください。",
  },
  {
    position: "right",
    img: "サラリーマン.png",
    msg: "現年収は350万、希望年収は400万になります。",
  },
];
